update system_archictecture.md
